{
  "@context": "http://schema.org",
  "@type": "Recipe",
  "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/53243811.jpg?tr=w-450",
  "name": "Black rice pudding",
  "recipeCategory": "Healthy breakfast ideas",
  "description": "This healthy rice pudding recipe is super-tasty for breakfast. Fortified hazelnut milk contains vitamin B12, helping us to think properly and stay alert, while hazelnuts are super-high in vitamin E, protecting our cells against damage. Enjoy!",
  "recipeYield": "4 jars",
  "totalTime": "PT50M",
  "recipeIngredient": [
    "200 g black rice ",
    "1  ripe mango ",
    "1  lime ",
    "1 tablespoon blanched hazelnuts ",
    "1 tablespoon  coconut flakes ",
    "2  ripe bananas ",
    "200 ml hazelnut milk ",
    "1 tablespoon vanilla extract ",
    "  manuka honey optional",
    "4 heaped tablespoons natural yoghurt ",
    "2  wrinkly passion fruit "
  ],
  "recipeInstructions": "<ol class=\"recipeSteps\"><li>Cook the black rice according to the packet instructions, overcooking it slightly so it’s plump and sticky, then drain and cool. </li><li>Meanwhile, peel and destone the mango, blitz the flesh in a blender with the lime juice until smooth, and pour into a bowl. </li><li>Separately, toast the hazelnuts and coconut in a dry frying pan until lightly golden, then bash up in a pestle and mortar. </li><li>Peel the bananas and tear into the blender, then blitz with the hazelnut milk, vanilla extract and two-thirds of the black rice – depending on the sweetness of your bananas, you could also add a teaspoon of honey. </li><li>Once smooth, stir that back through the rest of the rice – this will give you great texture and colour. Divide between four nice jars or bowls. </li><li>Spoon over the blitzed mango, squeeze half a passion fruit over each one, then delicately spoon over the yoghurt and sprinkle with the hazelnuts and coconut.</li></ol>",
  "keywords": "vegetarian, gluten-free, rice, grains pulses nuts, rice pudding, mango, fruit, yoghurt, dairy, banana, breakfast, Brilliant breakfast recipes, Breakfast, Healthy family recipes",
  "recipeCuisine": [
    "https://schema.org/VegetarianDiet",
    "https://schema.org/GlutenFreeDiet"
  ],
  "author": "Jamie Oliver",
  "nutrition": {
    "calories": "277 calories",
    "fatContent": "6.2 g fat",
    "saturatedFatContent": "2.5 g saturated fat",
    "proteinContent": "6.5 g protein",
    "carbohydrateContent": "48.4 g carbohydrate",
    "sugarContent": "11.4 g sugar",
    "sodiumContent": "0 g salt",
    "fiberContent": "5.2 g fibre",
    "@type": "NutritionInformation"
  },
  "datePublished": "2017-01-27",
  "url": "https://www.jamieoliver.com/recipes/rice-recipes/black-rice-pudding/"
}