{
  "@context": "http://schema.org",
  "@type": "Recipe",
  "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/76914327.jpg?tr=w-450",
  "name": "Chicken noodle stir-fry",
  "recipeCategory": "Healthy chicken recipes",
  "description": "This recipe demonstrates the principle of cooking hard and fast. I’m using chicken here, but you could try prawns, salmon or tofu instead – the key is to get everything lined up in order of cooking time, adding the ingredients that take the longest to the pan first. I’ve paired my chicken with broccoli, but feel free to add more veg, or mix it up with what you’ve got. Have fun with it.",
  "recipeYield": "2",
  "totalTime": "PT16M",
  "recipeIngredient": [
    "30 g unsalted peanuts ",
    "2 x 120 g free-range skinless chicken breasts ",
    "2 tablespoons black bean sauce ",
    "150 g medium free-range egg noodles ",
    "200 g tenderstem broccoli "
  ],
  "recipeInstructions": "<ol class=\"recipeSteps\"><li>Place a large non-stick frying pan on a medium heat and toast the peanuts as it heats up, tossing regularly, then remove and set aside, leaving the pan on the heat. </li><li>Meanwhile, score the chicken lengthways at 1cm intervals, going about halfway through. </li><li>In a bowl, toss the chicken with 1 tablespoon each of olive oil, red wine vinegar and black bean sauce to coat. Cook in the hot pan for 3 minutes on each side, or until dark, gnarly and cooked through.</li><li>Cook the noodles in a large pan of boiling salted water according to the packet instructions. </li><li>Trim the broccoli (halving any thick stalks lengthways) and add to the water for the last 2 minutes. </li><li>Remove the chicken to a board. Use tongs to carefully drag the just-cooked noodles and broccoli with a bit of their water straight into the frying pan. </li><li>Pound half the peanuts in a pestle and mortar until fine, toss into the pan with the remaining black bean sauce until well mixed, then divide between your plates. </li><li>Slice the chicken and place on top, scatter over the remaining peanuts, drizzle with a little extra virgin olive oil, and dig in.</li></ol>",
  "keywords": "chicken, poultry, chicken breast, noodles, dishes, broccoli, vegetable, black beans, bean, peanut, nuts, grains pulses nuts, peanuts, stir fry, cooking, keep cooking and carry on, Quick &amp; Easy – Series 2, Chicken, Stir fry, noodle salad, Keep Cooking and Carry On",
  "author": "Jamie Oliver",
  "nutrition": {
    "calories": "579 calories",
    "fatContent": "18.7 g fat",
    "saturatedFatContent": "3.4 g saturated fat",
    "proteinContent": "45.5 g protein",
    "carbohydrateContent": "60.7 g carbohydrate",
    "sugarContent": "5.5 g sugar",
    "sodiumContent": "1.4 g salt",
    "fiberContent": "4.3 g fibre",
    "@type": "NutritionInformation"
  },
  "datePublished": "2017-11-03",
  "url": "https://www.jamieoliver.com/recipes/chicken-recipes/quick-and-easy-chicken-noodle-stir-fry/"
}