{"@context":"http://schema.org","@type":"Recipe","image":"https://img.jamieoliver.com/jamieoliver/recipe-database/89080985.jpg?tr=w-450","name":"Italian seared beef","recipeCategory":"Quick &amp; easy recipes","recipeYield":"2","totalTime":"PT10M","recipeIngredient":["1 tablespoon pine nuts ","250 g rump steak ","2 heaped teaspoons green pesto ","40 g rocket ","15 g  Parmesan cheese "],"recipeInstructions":"<ol class=\"recipeSteps\"><li>Put a large non-stick frying pan on a high heat, toasting the pine nuts as it heats up, tossing regularly and removing when golden. </li><li>Cut the fat off the rump, finely chop the fat and place in the pan to render and crisp up while you cut the sinew off the rump, then season it with sea salt and black pepper. </li><li>Place between two sheets of greaseproof paper and bash to 1cm thick with a rolling pin, also tenderizing the meat. </li><li>Scoop out and reserve the crispy bits of fat, then sear the steak in the hot pan for 1 minute on each side, until golden but still blushing in the middle. Remove to a board.</li><li>Spread the pesto over a sharing platter. Thinly slice the steak at an angle, then plate up. Pile the rocket on top, then scatter over the pine nuts and reserved crispy fat, if you like. </li><li>Mix the steak resting juices with 1 tablespoon of extra virgin olive oil and drizzle over. Shave over the Parmesan, tossing before serving.</li></ol>","keywords":"steak, beef, meat, rump, sides and sauces, pesto, parmesan, cheese, dairy, rocket, vegetable, gluten-free, Quick &amp; Easy – Series 1, Salad, salad, salads, Quick fixes, Lunch &amp; dinner recipes, Beef, Cheese, Dinner for two, Romantic meals","recipeCuisine":["https://schema.org/GlutenFreeDiet"],"author":"Jamie Oliver","nutrition":{"calories":"321 calories","fatContent":"21.1 g fat","saturatedFatContent":"5.3 g saturated fat","proteinContent":"32.2 g protein","carbohydrateContent":"0.7 g carbohydrate","sugarContent":"0.5 g sugar","sodiumContent":"1 g salt","fiberContent":"0.3 g fibre","@type":"NutritionInformation"},"datePublished":"2017-11-07","url":"https://www.jamieoliver.com/recipes/beef-recipes/italian-seared-beef/"}