{
  "@context": "http://schema.org",
  "@type": "Recipe",
  "image": "https://img.jamieoliver.com/jamieoliver/recipe-database/89080978.jpg?tr=w-450",
  "name": "Sticky hoisin chicken",
  "recipeCategory": "One-pan recipes",
  "recipeYield": "2",
  "totalTime": "PT30M",
  "recipeIngredient": [
    "2 x 200 g free-range chicken legs ",
    "8  spring onions ",
    "1-2  fresh mixed-colour chillies ",
    "3  regular oranges or blood oranges",
    "2 heaped tablespoons hoisin sauce "
  ],
  "recipeInstructions": "<ol class=\"recipeSteps\"><li>Preheat the oven to 180ºC/350ºF/gas 4. </li><li>Put a non-stick ovenproof frying pan on a high heat. Pull off the chicken skin, put both skin and legs into the pan, season with sea salt and black pepper and let the fat render out and the chicken get golden for 5 minutes, turning halfway, while you trim the spring onions and halve across the middle, putting the green halves aside. </li><li>Toss the white spring onions into the pan, then transfer to the oven for 15 minutes. </li><li>Meanwhile, deseed the chillies, then finely slice lengthways with the green spring onions and pop both into a bowl of ice-cold water to curl and crisp up. </li><li>Peel the oranges, finely slice into rounds, and arrange on your plates. </li><li>Remove the chicken skin and soft spring onions from the pan and put aside. </li><li>Cook the chicken for 10 more minutes, or until tender and cooked through. </li><li>In a bowl, loosen the hoisin with a splash of red wine vinegar, then spoon over the chicken. Leave it in the oven while you drain and divide up the salad. </li><li>Sit the chicken and soft spring onions on top and crack over the crispy skin.</li></ol>",
  "keywords": "chicken leg, chicken, poultry, spring onion, onion, vegetable, chilli, orange, fruit, blood orange, dairy-free, chicken thighs, Chicken, roast chicken, Lunch &amp; dinner recipes, Dinner for two, Healthy chicken recipes, Healthy dinner ideas, Romantic meals",
  "recipeCuisine": [
    "https://schema.org/LowLactoseDiet"
  ],
  "author": "Jamie Oliver",
  "nutrition": {
    "calories": "430 calories",
    "fatContent": "19.5 g fat",
    "saturatedFatContent": "5.2 g saturated fat",
    "proteinContent": "29 g protein",
    "carbohydrateContent": "36.2 g carbohydrate",
    "sugarContent": "35 g sugar",
    "sodiumContent": "1.5 g salt",
    "fiberContent": "4.7 g fibre",
    "@type": "NutritionInformation"
  },
  "datePublished": "2017-11-03",
  "url": "https://www.jamieoliver.com/recipes/chicken-recipes/sticky-hoisin-chicken/"
}