{"@context":"http://schema.org","@type":"Recipe","image":"https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/large/1057_1_1441269382.jpg?tr=w-450","name":"Brilliant broccoli","recipeCategory":"Cheap &amp; cheerful","description":"To keep broccoli beautifully green and slightly crunchy it’s best to boil or steam for just a few minutes.","recipeYield":"4","totalTime":"PT20M","recipeIngredient":["  sea salt ","  freshly ground black pepper ","1 large head of broccoli ","a small of knob of  unsalted butter "],"recipeInstructions":"<ol class=\"recipeSteps\"><li>Fill a large pan with water, add a tiny pinch of salt and bring to the boil over a high heat.</li><li>Meanwhile, on a chopping board, cut the florets from the broccoli, then cut or break them into bite-sized pieces.</li><li>Trim and cut the stalk in half, then finely slice it.</li><li>Once boiling, use a slotted spoon to carefully lower the broccoli into the water.</li><li>Cook for 3 to 4 minutes, or until tender – you should be able to poke the tip of a knife easily into the florets.</li><li>Drain over the sink into a colander, then leave to steam dry for a minute.</li><li>Tip back into the pan, then sprinkle with a tiny pinch of salt and pepper.</li><li>Add the butter and toss to coat, then tip into a serving bowl and serve.</li></ol>","keywords":"broccoli, gluten-free, vegetarian, vegetable, vegetables, family food, Family one-pan recipes, Lunch &amp; dinner recipes, Money-saving recipes, One-pan recipes, Quick &amp; easy recipes, Quick fixes, Sides, Vegetable sides, Vegetables, Mother's day, St. George's Day, Sunday lunch, Thanksgiving, Family money-saving recipes","recipeCuisine":["https://schema.org/GlutenFreeDiet","https://schema.org/VegetarianDiet"],"author":"Jamie Oliver","nutrition":{"calories":"45 calories","fatContent":"2.3 g fat","saturatedFatContent":"1.3 g saturated fat","proteinContent":"2.1 g protein","carbohydrateContent":"3.1 g carbohydrate","sugarContent":"1.3 g sugar","sodiumContent":"0.2 g salt","fiberContent":"2.9 g fibre","@type":"NutritionInformation"},"datePublished":"2015-09-16","url":"https://www.jamieoliver.com/recipes/vegetables-recipes/brilliant-broccoli/?family-food-category=105031"}