{"@context":"http://schema.org","@type":"Recipe","image":"https://img.jamieoliver.com/jamieoliver/recipe-database/CbNGYO21a4z89_Z6zsmStr.jpg?tr=w-450","name":"Grilled steak with herby brown rice","description":"Blackening peppers over a flame or under the grill is a brilliant way to inject some delicious smoky, sweet flavours into your dish. Steaming them in a covered bowl is super important, too – it’ll help loosen the skins, which will make peeling them a lot easier. Sliced up and tossed through the grilled steak and its juices, then served with herby rice make this a brilliant, flavour-packed dinner. Plus, store cupboard staple, brown rice, contains a bumper source of vitamins and minerals, including selenium for efficient immune system function.","recipeYield":"2","totalTime":"PT40M","recipeIngredient":["1  red pepper ","150 g brown basmati rice ","½ a bunch of fresh flat-leaf parsley (15g) ","3  spring onions ","2 x 125 g flank steak ","  olive oil ","25 g shelled pistachios ","  extra virgin olive oil ","1  lemon ","2 tablespoons fat-free natural yoghurt ","30 g feta cheese "],"recipeInstructions":"<ol class=\"recipeSteps\"><li>Place the pepper over the flame on your hob or under a hot grill and char for 15 minutes, or until blackened and blistered all over, turning occasionally.</li><li>Cook the rice in boiling salted water according to the packet instructions, then drain. Return to the pan and keep covered until needed.</li><li>Once charred, place the pepper in a bowl, cover and leave to steam for 10 minutes, then leave to cool.</li><li>Pick and finely chop the parsley leaves, then trim and finely slice the spring onions.</li><li>Place the steak onto a board, cover with clingfilm, then bash with a rolling pin until 1cm thick.</li><li>Discard the clingfilm, drizzle over a little olive oil, season well with sea salt and black pepper, then massage into the meat.</li><li>Rub the skin off the pepper, then halve, deseed and tear the flesh into strips, placing on a plate as you go.</li><li>Place a large non-stick frying pan over a high heat, scatter in the pistachios and toast until golden, then roughly chop. Return the pan to the heat.</li><li>Place the steak into the hot pan, and cook for 6 minutes, or until browned but still pink in the middle, turning regularly.</li><li>Stir the parsley and spring onions through the rice with 1 tablespoon of extra virgin olive oil and a pinch of pepper. Finely grate in the lemon zest and squeeze over half the juice, then pile onto plates.</li><li>Mix the yoghurt with a squeeze of lemon juice, then season to taste.</li><li>Rest the steak for 3 minutes, then finely slice and toss with the pepper. Place on top of the rice, crumble over feta, scatter with pistachios, and serve with yoghurt.</li></ol>","keywords":"steak, beef, meat, bell pepper, vegetable, pepper, peppers","author":"Jamie Oliver","nutrition":{"calories":"735 calories","fatContent":"33.7 g fat","saturatedFatContent":"9.6 g saturated fat","proteinContent":"43 g protein","carbohydrateContent":"68.8 g carbohydrate","sugarContent":"10.7 g sugar","sodiumContent":"1.2 g salt","fiberContent":"6.7 g fibre","@type":"NutritionInformation"},"datePublished":"2016-10-27","url":"https://www.jamieoliver.com/recipes/beef-recipes/grilled-steak-with-herby-brown-rice/"}